# 8.	Баскетболно оборудване
# Джеси решава, че иска да се занимава с баскетбол, но за да тренира е нужна екипировка. Напишете програма, която
# изчислява какви разходи ще има Джеси, ако започне да тренира, като знаете колко е таксата за тренировки по баскетбол
# за период от 1 година. Нужна екипировка:
# •	Баскетболни кецове – цената им е 40% по-малка от таксата за една година
# •	Баскетболен екип – цената му е 20% по-евтина от тази на кецовете
# •	Баскетболна топка – цената ѝ е 1 / 4 от цената на баскетболния екип
# •	Баскетболни аксесоари – цената им е 1 / 5 от цената на баскетболната топка
# Вход
# От конзолата се четe 1 ред:
# •	Годишната такса за тренировки по баскетбол – цяло число в интервала [0… 9999]

annual_tax_for_train = int(input())

shoes = annual_tax_for_train - (annual_tax_for_train * 0.4)
clothes = shoes - (shoes * 0.2)
ball = clothes * 0.25
accessories = ball * 0.2
final_price = shoes + clothes + ball + accessories + annual_tax_for_train

print(final_price)
