# Вход
# Входът се чете от конзолата и съдържа точно 4 реда:
# 1.	Необходимо количество найлон (в кв.м.) - цяло число в интервала [1... 100]
# 2.	Необходимо количество боя (в литри) - цяло число в интервала [1…100]
# 3.	Количество разредител (в литри) - цяло число в интервала [1…30]
# 4.	Часовете, за които майсторите ще свършат работата - цяло число в интервала [1…9]
# •	Предпазен найлон - 1.50 лв. за кв. метър
# •	Боя - 14.50 лв. за литър
# •	Разредител за боя - 5.00 лв. за литър

plastic = (int(input())+2) * 1.5
paint = (int(input())*1.1) * 14.5
thinner = int(input()) * 5
hours_needed_for_workers = int(input())

bags = 0.4
workers_fee = (plastic+paint+thinner+bags)*0.3
total_amount = plastic+paint+thinner+bags+(workers_fee*hours_needed_for_workers)

print(total_amount)
